# IsSlab Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..IsSlab Property
MassSurfaceData Class See Also
---
Indicates if a floor is a slab.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsSlab { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsSlab As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsSlab {
	bool get ();
}
```

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace